National_bank_xml/PRISTIGAO_MT102.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Gj9vj6ngJt+omIr/sZAYcna33NyaHE6ETzN/gYHd+z0oERpNarY+ojikiBu/wfJzZkwU4bSI67Hh&#13;
yYA8rw2osbBEPabYl4o8WgxEfWBq3fqIDQ0uyUJwFtyYGxVLFt/e6J3GYAMvy3rieJU9jJyJT8Wv&#13;
b1CK3L3M0ufLWdTjWZ4=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>bdBmi5l7Cca/FAYFfiaXiv9ut2iInFNQtO0nfDLqbMDv1QPUPKFAnDEflk0fvAddCfrnmun+6U8Q&#13;
CK09d/vxW+f3yAfTWEs1KzKcmn2ZewOiwOhyqi0ct/TTDuyWISMkTf437XLmRcyhjQXcTm8pJyvc&#13;
mYs7EiJOb7hBZ4dNig00hD//X8Ijtf+P2WQzMyaVut2whEERA/nLfMRv+OVTFZp5+IRzluJM7Rp3&#13;
XabrFCg7XsDDLVmnXvvk7Ghq5ahwbI/1bP+YXE4vg7KpFMU7rGQmNdM39uM+zLpQgpXEHkbW2DEc&#13;
X4xj808yR+Y6mbdoGA3UX5cIyd7YS6sQLwSUKUPK/BzVzhhDBIOjZakJN0SUMfPplQT+D/rtk68l&#13;
YDl2e1sIiyuK8ImcaCtwK9zSlCYdI7PUl/8uwgJ8lB9QuMk/v38oqFvz7+AAk+S6UWXhgLGktn1Z&#13;
+2S1uDx3+BA2c9/9kGp0GU4ult8lA6Mw9Wio9Ys9p9XdUzK/ubbivMnvvoD6HbW7GY68RSdFlIRf&#13;
grLIrdwiIXJ67fLHKjyb0mN7KWnkLxkWGuf6l8gCJw9EOsdGlz2wj+sr1bS8pWKJ0DaRmeEsBk+Y&#13;
NMH3c0zxkVS4g3Wg781k1/MJnsydNgkiIrBIcPvwYYyp3/qe6xZ4yejPUrW64FjoP8JAyVEcVokG&#13;
Qm/ToZmaAG3d4TY5sr6HftBKdtlBjz0W5e23pihUsnPM3kUfX9QvnheV0cZ0ej+8Gt7Q3iSg/a97&#13;
cvb0oaeAOXej5UkHQce8qrpAcIqrCGfQOje0sc/pVshvejva5A5WerY2ZnSpIvMpkjY9/w+kE+qZ&#13;
upqm3e9qxn3WwXUeMC0jT+l0yz9xRUeucZO4TpssXm4Gs1fwYo7kQCtZO+QUR+JeXrX+jGLPzn5R&#13;
S/6xAy1UtnUTooFdt5ZrYH1J8faQTqBR2xto34ok5uEkN/4sZIHPkoCFXOpc4Bu7nEjYFixA//tl&#13;
Xyxgj9HZ2mQ0spirOhOSGwQHT5lHcisvFWf+jpT3IW9d5lL5TG9LyYmepos67cKML5R5jpd8TesP&#13;
znJkFQcqkNBBTOg3FbDt7aCytXn988+shEwZi8EvdAi+8YSHRm+dmSk/h6I+dSH6y29aZlCaR4rA&#13;
O9+1UM9HqaVdtVq69jXHWh7byiMZGkLUSuzlPWBf82vDtGz3jV0CZYx1B3lBh4bS7FSl2EUfVPwH&#13;
nnYbGM+nYEYL9VcVIPUCNPz/dpenJsUGyVWAIu2EchR1VC9GlXXnZ3cDntaDAF1vYF6GVmbR4OOE&#13;
ZKv/zdrG2V8PDmw3r1KvuTYNFI06FyhqozN5rNkJQyecLmMVrmGO2oq+LdmCH/8TzC7p015Mjhdt&#13;
xSf9kbi80t688rN5z0p/8IXDBUkzI06UHm8bdpEcYUs4lvwD3n8a/Tu88f07ijxpTIXejOPJqC4t&#13;
PlHoGX88rjRyriKdDU2oqLFvYC6563muPS4PJ1B0yYxXsLnAaadw4ot9C5rF2s4U8vr4ftC8mJGJ&#13;
F0EKaHrBYvgd5/Nsdl2iMY3kQoMYvqcr+tRdfHrRAD0e9NIWm548t1/PVHmEvaOtiWewOspLTTxd&#13;
x20Q4+Ky1PYeEqnHe4xy019BJP71jBumHztV</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>WvSfdVLHZJQPbypI0+JIzcTiaMA=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
vXy2TKY5HCimF6hSEjM85oM+C97a8qDkPGNLqGLRGe3Wxdxv+hiG2GlUNYy8zPcBs8oHIAlvk1Kz&#13;
B1hvISZgwU6AXeOkJt1RETCDyn9vrgGQkaFCPFRN+KzRmHD4mS31/dHV0zcvtdu96s/59NAoBkA+&#13;
4Q4zUhoXS0koTB/UkLo=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>